"""
Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список. Тобто, в результаті повинен
вийти список із 2-х списків.

Якщо в початковому списку непарна кількість елементів, то в першому списку має бути більше елементів.

Якщо у списку немає елементів, то має бути створений список із двома порожніми списками.

Важливо! Потрібно створити рішення, яке обробляє 3 випадки - список порожній, у списку парна кількість елементів і в
списку непарна кількість елементів.
Для перевірки коректності роботи Вашого коду використовуйте приклади вище. Робити запит на введення даних від
користувача не потрібно.
"""

some_list = [1, 2, 3, 4, 5]
some_list_length = len(some_list)

if not some_list_length:
    result_list = [some_list, some_list]
else:
    center_of_list = int((some_list_length + 1) / 2) if some_list_length % 2 else int(some_list_length / 2)
    list1, list2 = some_list[:center_of_list], some_list[center_of_list:]
    result_list = [list1, list2]

print(result_list)
