"""
Ваша програма має перенести останній елемент списку з кінця на початок, тобто, останній елемент списку має стати першим.
 Послідовність інших елементів не має змінюватися.

Порожній список або список з одним елементом повинен залишитися незмінним.

Кількість елементів у списку може бути будь-яким – нуль та більше!

Для перевірки коректності роботи Вашого коду використовуйте приклади вище. Робити запит на введення даних від
користувача не потрібно.
"""

some_list = [12, 0, 15, 687, 18, "ok"]
if len(some_list) > 1:
    last_element = some_list.pop(-1)
    some_list.insert(0, last_element)

print(some_list)
